app/Models/ModelLokasi.php

INSERT INTO `tbl_lokasi` (`nama_lokasi`, `alamat_lokasi`, `latitude`, `longitude`, `foto_lokasi`) VALUES ('SMA Daar Al-uluum Kisaran', 'Jln. Mahoni (Sibogat) Kisaran, Mekar Baru', '2.9885519418655333', '99.62010875344278', '1713533985_4ddea7a69469b48efce8.jpg')
---
    public function insertData($data){
        $this->db->table('tbl_lokasi')->insert($data);

SELECT *
FROM `tbl_lokasi`
---
    public function getAllData(){
        return $this->db->table('tbl_lokasi')->get()->getResultArray();

SELECT *
FROM `tbl_lokasi`
WHERE `id_lokasi` = '1'
---
    public function getDataById($id_lokasi){
        return $this->db->table('tbl_lokasi')
        ->where('id_lokasi', $id_lokasi)
        ->get()->getRowArray();

UPDATE `tbl_lokasi` SET `id_lokasi` = '1', `nama_lokasi` = 'Lokasi AB', `alamat_lokasi` = 'Jl. Lokasi A', `latitude` = '2.993527357889709', `longitude` = '99.60809632592557', `foto_lokasi` = '1711276621_23e76a429ed9e13747f4.jpg'
WHERE `id_lokasi` = '1'
---
    public function updateData($data){
        $this->db->table('tbl_lokasi')
        ->where('id_lokasi', $data['id_lokasi'])
        ->update($data);

DELETE FROM `tbl_lokasi`
WHERE `id_lokasi` = '1'
AND `id_lokasi` = '1'
---
    public function deleteData($data){
        $this->db->table('tbl_lokasi')
        ->where('id_lokasi', $data['id_lokasi'])
        ->delete($data);