app/Models/ModelHome.php

    public function JumlahLokasi()
    {
        return $this->db->table('tbl_lokasi')
            ->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_lokasi`